In [79]:
import numpy as np 
from numpy.random import random_integers
a = np.array([1,2,3,4,5,6,7,8,9])
a[0]=10
a[:5:2]

mda = np.array([[1,2],[2,3]])
mda[0][0]
print(mda.ndim)
print(a.ndim)
print(mda.size)
a.dtype

rand = np.empty(10)
rand = np.arange(10)
rand = np.linspace(0,10,20)
rand

2
1
4

array([ 0.        ,  0.52631579,  1.05263158,  1.57894737,  2.10526316,
        2.63157895,  3.15789474,  3.68421053,  4.21052632,  4.73684211,
        5.26315789,  5.78947368,  6.31578947,  6.84210526,  7.36842105,
        7.89473684,  8.42105263,  8.94736842,  9.47368421, 10.        ])

In [80]:
import pandas as pd 
#pd.DataFrame({'A':[1,2,3]})
li = [1,2,3,4]
s = pd.Series(li) # coverts the arg to series 
print(s)
s[0]

0    1
1    2
2    3
3    4
dtype: int64

1

In [81]:
#user defined index
index = ['a','b','c','d']
s2 = pd.Series(li,index) 
print(s2)
s2[1]
#s2['b']
# all this can be done using dictionary at once

a    1
b    2
c    3
d    4
dtype: int64

C:\Users\aswin\AppData\Local\Temp\ipykernel_23492\3878137405.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[1]

2

In [82]:
data = np.random.randint(0,100,size =(4,3)) # rows cols 
rows = ['d','e','f','g']
col = ['a','b','c']

In [83]:
# creating data frame 

df = pd.DataFrame(data , rows , col)
df

    a   b   c
d  42  22  21
e  87  76  95
f  42  15  79
g  39  41  75

In [84]:
# data frame using csv file .
import csv 
df2 = pd.read_csv("car-sales.csv")
df2

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [85]:
# how to pull data out from a data frame 
df2.loc[0]# pull out rows

Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [86]:
# pull out multiple rows
df2.loc[[0,9,2]]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
9  Nissan  White          31600      4  $9,700.00
2  Toyota   Blue          32549      3  $7,000.00

In [87]:
# get first five rows
df2.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [88]:
# get n no of rows 
df2.head(8)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00

In [89]:
# get last 5 rows 
df2.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [90]:
# last n rows 
df2.tail(6)

     Make Colour  Odometer (KM)  Doors      Price
4  Nissan  White         213095      4  $3,500.00
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [91]:
# get information about the df (info function)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [92]:
# shape of df not a func no braces 
df2.shape

(10, 5)

In [93]:
# dimensions of the df 
df2.ndim

2

In [94]:
# get col datatypes 
df2.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [95]:
# describe data 
df2.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [96]:
# describe a specific col 
df2["Price"].describe()
df2["Make"].describe()

count         10
unique         4
top       Toyota
freq           4
Name: Make, dtype: object

In [97]:
# getting columns using braces
df2["Make"]
df2["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [98]:
# getting cols using dot 
df2.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [99]:
# getting cols using location 
df2.iloc[:, 2]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [100]:
# count data 

d = pd.read_csv("dog_data.csv")
d

                    Breed              Color        DogName  OwnerZip
0                COCKAPOO              BROWN        CHARLEY     15236
1            GER SHEPHERD        BLACK/BROWN         TACODA     15238
2           BELG MALINOIS            BRINDLE           EICH     15238
3                   MIXED        BLACK/BROWN          ARROW     15104
4     AM PIT BULL TERRIER        WHITE/BROWN         OAKLEY     15139
...                   ...                ...            ...       ...
2665         GOLDENDOODLE              BROWN        WINSLOW     15044
2666    YORKSHIRE TERRIER        BLACK/BROWN  ROCKY KALAKOS     15220
2667              LAB MIX  WHITE/BLACK/BROWN          ELLIE     15220
2668         GOLDENDOODLE              WHITE       CLARENCE     15143
2669    SHETLAND SHEEPDOG              BLACK        GRIFFIN     15136

[2670 rows x 4 columns]

In [101]:
# count distinct values in descending order
d["Breed"].value_counts()

Breed
MIXED                 235
LAB MIX               185
LABRADOR RETRIEVER    178
GOLDEN RETRIEVER       99
BEAGLE                 77
                     ...
AKITA MIX               1
REDBONE COONHOUND       1
MOUNTAIN CUR            1
LOWCHEN                 1
BRIARD SHEEPDOG         1
Name: count, Length: 185, dtype: int64

In [102]:
# count distinct values in ascending order
d["Breed"].value_counts(ascending=True)

Breed
CATAHOULA LEOPARD D      1
BOYKIN SPANIEL           1
DALMATION MIX            1
FOX TERRIER SMOOTH       1
ENG SHEPHERD             1
                      ...
BEAGLE                  77
GOLDEN RETRIEVER        99
LABRADOR RETRIEVER     178
LAB MIX                185
MIXED                  235
Name: count, Length: 185, dtype: int64

In [103]:
# names without NaN
d["DogName"].value_counts()

DogName
LUCY       35
BELLA      30
BAILEY     29
BUDDY      29
DAISY      26
           ..
CHOOKIE     1
AMY         1
DEE DEE     1
KAYLIE      1
GRIFFIN     1
Name: count, Length: 1428, dtype: int64

In [104]:
# names with NaN
d["Breed"].value_counts(dropna=False)

Breed
MIXED                 235
LAB MIX               185
LABRADOR RETRIEVER    178
GOLDEN RETRIEVER       99
BEAGLE                 77
                     ...
AKITA MIX               1
REDBONE COONHOUND       1
MOUNTAIN CUR            1
LOWCHEN                 1
BRIARD SHEEPDOG         1
Name: count, Length: 185, dtype: int64

In [107]:
# get relative percentages 
d["Breed"].value_counts(normalize=True)

Breed
MIXED                 0.088015
LAB MIX               0.069288
LABRADOR RETRIEVER    0.066667
GOLDEN RETRIEVER      0.037079
BEAGLE                0.028839
                        ...
AKITA MIX             0.000375
REDBONE COONHOUND     0.000375
MOUNTAIN CUR          0.000375
LOWCHEN               0.000375
BRIARD SHEEPDOG       0.000375
Name: proportion, Length: 185, dtype: float64

In [111]:
# specific item count 
d["Color"].value_counts()["BLACK"]

371

In [113]:
# count unique values group by size 
d.groupby('Color').size()

Color
APRICOT              15
BEIGE                 5
BLACK               371
BLACK WITH WHITE     21
BLACK/BRINDLE         5
                   ...
WHITE/ORANGE          5
WHITE/RED            14
WHITE/TAN            50
WHITE/YELLOW          2
YELLOW               51
Length: 72, dtype: int64

In [114]:
# count unique values group by count
d.groupby('Color').count()

                  Breed  DogName  OwnerZip
Color
APRICOT              15       15        15
BEIGE                 5        5         5
BLACK               371      371       371
BLACK WITH WHITE     21       21        21
BLACK/BRINDLE         5        5         5
...                 ...      ...       ...
WHITE/ORANGE          5        5         5
WHITE/RED            14       14        14
WHITE/TAN            50       50        50
WHITE/YELLOW          2        2         2
YELLOW               51       51        51

[72 rows x 3 columns]